package Nedelja1.Nedelja1_ZadaciNedelja;//3*. Програм креира скривени број од 0 до 100, користик има на располагању
//        максимално 10 корака да пронађе скривени број, програм, након сваког унетог
//        покушаја исписује да ли је скривени број “мањи” или “већи” од унетог броја,
//        ако је број исти исписује “Браво! Пронашли сте број!” и програм се завршава.
//        ● Програм креира насумичан (random) број од 0 до 100,помоћ - (int)
//        (Math.random() * 100); користимо класу Math са методом random() која
//        нам даје број између 0 и 1 (нпр. 0,20 ; 0,72 ...) множимо са 100 да би
//        направили број од 0 до 100;
//        ● Ако је број који је корисник унео једнак броју креираном од стране
//        рачунара исписати “Браво! Пронашли сте број!” и програм се прекида;
//        ● Након 10 покушаја програм се зауставља.
//        Пример улаза и излаза.
//        Улаз:
//        нпр. рачунар изабере број 13 који се налзи између 0 и 100
//        корисник уноси бројеве:
//        улаз - 50
//        излаз - мањи
//        траг - “сада знамо да је скривени број између 0 и 50”
//        улаз - 25
//        излаз - мањи
//        траг - “сада знамо да је скривени број између 0 и 25”
//        улаз - 13
//        Излаз - “Браво! Пронашли сте број!”

import java.util.Scanner;

public class Zadatak3 {
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int Random = (int) (Math.random() * 100);

        for (int i=1; i<=10; i ++) {
            System.out.println("Unesite broj: ");
            int x = sc.nextInt();

            if (x == Random) {
                System.out.println("Bravo! Pronasli ste broj!"); break; }
            else {
                if (x < Random) {
                    System.out.println("Trazeni broj je veci");}
                else {
                    System.out.println("Trazeni broj je manji");}
            }
        }

    }
}
